# vagrant

Standalone
----------

It is used to launch a standalone server

Servers
-------

It is used to launch db and web servers

Commands
--------
  

> vagrant status:
This command will show you the current status of the virtual machine.

> vagrant suspend:
This command suspends your virtual machine. All of your work is saved and the machine is put into a “sleep mode” of sorts. 

> vagrant up:
This gets your virtual machine up and running again. 

> vagrant ssh:
This command will actually connect to and log you into your virtual machine. 

> vagrant halt:
This command halts your virtual machine. All of your work is saved and the machine is turned off - think of this as “turning the power off”. 

> vagrant destroy:
This command destroys your virtual machine.

> vagrant box update:
This command updates your boxes.

> vagrant box prune:
This commande removes old boxes.
